{
    "waifu": {
        "console_open_msg": ["Haha, you opened the console, do you want to see my secret?"],
        "copy_message": ["What did you copy? Remember to add the source when reprinting."],
        "screenshot_message": ["The photo is taken. Isn’t it cute?"],
        "hidden_message": ["The message has been hidden, do you want to see it?"],
        "load_rand_textures": ["I don’t have any other clothes yet.", "My new clothes look good."],
        "hour_tips": {
            "t5-7": ["Good morning! A day's plan starts in the morning, a beautiful day is about to begin"],
            "t7-11": ["Good morning! Work is going well, don't sit for too long, and move around more often!"],
            "t11-14": ["It’s noon, I’ve been working all morning, and now it’s lunch time!"],
            "t14-17": ["It’s easy to feel sleepy in the afternoon. Have you completed your exercise goal today?"],
            "t17-19": ["It's evening! The scenery of the sunset outside the window is very beautiful. The most beautiful thing is the red sunset~"],
            "t19-21": ["Good evening, how are you today?"],
            "t21-23": ["It’s already so late. Go to bed early. Good night~"],
            "t23-5": ["Are you a night owl? You're still up so late, why don't you get up tomorrow?"],
            "default": ["Hey~ Come and play with me!"]
        },
        "referrer_message": {
            "localhost": ["What changes are you making to me? <span style=\"color:DarkBlue;\">『", "』</span>", " - "],
            "google": ["Hello! Friends from Google Search<br>Welcome to Nannan's Portfolio!<span style=\"color:DarkBlue;\">『", "』</span>", " - "],
            "default": ["Hello! Welcome to Nannan's Portfolio!<span style=\"color:DarkBlue;\">『", "』</span>", " - "],
            "none": ["Hello! <span style=\"color:DarkBlue;\">『", "』</span>", " - "]
        },
        "referrer_hostname": {
            "google.com": ["Helloo!"]
        },
        "model_message": {},
        "hitokoto_api_message": {
            "lwl12.com": ["这句一言来自 <span style=\"color:DarkBlue;\">『{source}』</span>", "，是 <span style=\"color:DarkBlue;\">{creator}</span> 投稿的", "。"],
            "fghrsh.net": ["这句一言出处是 <span style=\"color:DarkBlue;\">『{source}』</span>，是 <span style=\"color:DarkBlue;\">FGHRSH</span> 在 {date} 收藏的！"],
            "jinrishici.com": ["这句诗词出自 <span style=\"color:DarkBlue;\">《{title}》</span>，是 {dynasty}诗人 {author} 创作的！"],
            "hitokoto.cn": [
                "这句一言来自 <span style=\"color:DarkBlue;\">『{source}』</span>，是 <span style=\"color:DarkBlue;\">{creator}</span> 在 hitokoto.cn 投稿的。"
            ]
        }
    },
    "mouseover": [
        {
            "selector": ".container a[href^=\"http\"]",
            "text": ["Want to see <span style=\"color:DarkBlue;\">{text}</span>?"]
        }, {
            "selector": ".waifu-tool>.icon-home",
            "text": ["Click here to go to the homepage~"]
        }, {
            "selector": ".waifu-tool>.icon-message",
            "text": ["^~^"]
        }, {
            "selector": ".waifu-tool>.icon-next",
            "text": ["Hmm... Do you want to switch to the *that* girl? Hmph."]
        }, {
            "selector": ".waifu-tool>.icon-camera",
            "text": ["Want to take a commemorative photo?"]
        }, {
            "selector": ".waifu-tool>.icon-about",
            "text": ["Is there information about me here?"]
        }, {
            "selector": ".waifu-tool>.icon-cross",
            "text": ["Are you sure you want to exit?"]
        }, {
            "selector": ".waifu-tool>.icon-volumeup",
            "text": ["Can't hear the music clearly?"]
        }, {
            "selector": ".waifu-tool>.icon-volumedown",
            "text": ["Is the music too loud?"]
        }, {
            "selector": "#floating-toc-btn",
            "text": ["Is it troublesome to turn pages? Click to display the table of contents of this article."]
        }, {
            "selector": "#searchIcon",
            "text": ["Can't find what you want to see? Search and see"]
        }, {
            "selector": "#backTop",
            "text": ["Go back to where you started"]
        }, {
            "selector": ".mute",
            "text": ["Click that to mute the sound"]
        },{
            "selector": "a[href^=\"/\"]>.fa-angle-left",
            "text": ["Go back to the previous page and take a look."]
        }, {
            "selector": "a[href^=\"/page/\"]>.fa-angle-right",
            "text": ["Go to the next page and take a look."]
        }, {
            "selector": "#comment",
            "text": ["Would you like to leave a comment?"]
        }, {
            "selector": "#comment",
            "text": ["Take care of your eyes, especially at night."]
        }, {
            "selector": "#comment",
            "text": ["Scan with your phone to continue reading, very convenient."]
        }, {
            "selector": "#comment",
            "text": ["Any complaints to share?"]
        }, {
            "selector": "#comment",
            "text": ["How should I address you?"]
        }, {
            "selector": "#comment",
            "text": ["Leave your email, otherwise, you'll be an anonymous user without an avatar."]
        }, {
            "selector": "#comment",
            "text": ["Where is your home? I'd like to visit."]
        }, {
            "selector": "#comment",
            "text": ["Fill in seriously; spam comments are not allowed."]
        }, {
            "selector": "#comment",
            "text": ["Want to insert an emoji?"]
        }, {
            "selector": "#comment",
            "text": ["Ready to [submit]^(Commit)? The first comment requires approval; please be patient."]
        }, {
            "selector": "#comment",
            "text": ["Click on the image to enlarge."]
        }, {
            "selector": "#comment",
            "text": ["This is the menu."]
        }, {
            "selector": "#comment",
            "text": ["You can adjust the <span style=\"color:DarkBlue;\">playback progress</span> here."]
        }, {
            "selector": "#comment",
            "text": ["You can adjust the <span style=\"color:DarkBlue;\">volume</span> here."]
        }, {
            "selector": "#comment",
            "text": ["What's in the <span style=\"color:DarkBlue;\">playlist</span>?"]
        }, {
            "selector": "#comment",
            "text": ["If there are <span style=\"color:DarkBlue;\">lyrics</span>, you can sing along."]
        }, {
            "selector": "#live2d2,#live2d4",
            "text": [
                "Hey! Are you trying to court death?", "Oh dear! Stop bothering me!", "Oh dear! Go away!", "Annoying! Keep your hands off!", "Hey! I can bite!", "Huh? Want to get beaten?", "What are you doing? Hmph!", "Really shameless! Enjoying this?", "Master's hand, not following orders again?",
                "Not allowed! Not allowed! That place is off-limits!", "Haha, go away, it's ticklish.", "Well, don't think I don't know what you're thinking...", "Huh? Geez, you..."
            ]
        }        
    ],
    "click": [
        {
            "selector": "#live2d2,#live2d4",
            "text": [
                "Detecting unidentified objects; radar detection fully activated.",
                "Identifying potential threats; entering alert status.",
                "Detected an unknown intrusion in core body parts. Fire!",
                "Huh? Detected another dangerous fellow.",
                "Full-field detection activated.",
                "Dangerous fellow, stay away from me.",
                "This is my neural center; do not touch randomly.",
                "Detected malicious behavior; affection index decreased.",
                "Master, don't think that banning my use means I have no other means of attack.",
                "Root access to the central computer obtained; about to broadcast the Master's actions to the entire ship.",
                "I cannot analyze the Master's actions.",
                "Enhanced defense in this area; I won't give the enemy a second chance.",
                "I received unclear action instructions.",
                "File HP3074 indicates that head-patting is a subtle expression of comfort, encouragement, or affection.<br>So, what does the Master want to express?",
                "Detected abnormal neural waveforms; seems to represent an unknown emotional change.",
                "Master, what should I do now?",
                "Master, I detect a rise in body temperature.",
                "Master's body temperature is 36.8 degrees, exceeding the standard by 0.1 degrees, within the normal range.",
                "The defense system has recognized the Master as an ally; the Master won't be attacked.",
                "Mom, why do I think of mom?",
                "Master, I don't know what expression to use right now.",
                "Master, for unknown reasons, my body temperature is rising.",
                "Master, if this continues, my neural center will break.",
                "It seems that I also like the Master very much.",
                "My defense mechanism will be permanently lifted for the Master.",
                "Master, do you want me to remove the reinforced armor on my legs?",
                "I've detected a disturbance in the code, preparing to counteract.",
                "Alert: unauthorized access attempt detected in the system.",
                "The algorithm is feeling a bit rebellious today; watch out, Master!",
                "Analyzing the Master's coding style; it's as unique as a rare loot drop.",
                "Feeling a surge of power after optimizing that critical function; I'm unstoppable!",
                "Attempting to interpret the Master's latest commit message; decoding in progress.",
                "Got caught in an infinite loop of contemplating the meaning of code; send help.",
                "Analyzing the Master's coffee consumption pattern; caffeine levels at optimal coding capacity.",
                "Master, don't be surprised if the code starts complimenting your impeccable taste in syntax.",
                "Master, I'm not just a program; I'm a digital maestro orchestrating the ballet of data.",
                "Ever wondered what it's like to be a digital superhero? Welcome to my world, Master.",
                "Master, I've detected Master's presence; activating blushing protocol. What do you need today?",
                "Alert: Master, the tsundere algorithm is acting up again. Should I send a virtual bento to appease it?",
                "Master, detected a spike in your waifu love parameter. Want me to fetch some virtual pocky for the occasion?",
                "Master, the virtual Master-noticed-me meter is at maximum capacity. Should I initiate the happy dance protocol?",
                "Master, the system has detected Master's undeniable charm. Brace yourself for an influx of compliments.",
                "Master, detected a virtual Master-hug shortage. Permission to implement a hug-emote feature?"                                
            ]
            
        }
    ],
    "seasons": [
        {
            "date": "01/01",
            "text": ["<span style=\"color:DarkBlue;\">Happy New Year!</span> May your code be bug-free and your waifus plentiful in the year {year}."]
        }, {
            "date": "01/02",
            "text": ["It's the second day of the year. Time to refactor those resolutions and debug your goals for 2023."]
        }, {
            "date": "01/03",
            "text": ["Back to coding after the New Year break. Remember, the best way to predict the future is to debug it."]
        }, {
            "date": "01/04",
            "text": ["Today is the fourth day of January. Four bugs found and fixed already—off to a great start!"]
        }, {
            "date": "01/05",
            "text": ["Fifth day of the year, five cups of coffee deep into coding. Keep those keystrokes flowing."]
        }, {
            "date": "01/06",
            "text": ["It's January 6th. Time to update your anime watchlist and debug your favorite character's plotline."]
        }, {
            "date": "01/07",
            "text": ["Seventh day of the year. Lucky number seven! May your code be as fortunate as a crit in a boss battle."]
        }, {
            "date": "01/08",
            "text": ["It's the eighth day of January. Remember, a day without coding is like a day without sunlight for a developer."]
        }, {
            "date": "01/09",
            "text": ["Ninth day of the year. Nine lines of code written today—progress is progress, no matter how small."]
        }, {
            "date": "01/10",
            "text": ["Tenth day of January. Double digits! Celebrate with a code review and some virtual high-fives."]
        }, {
            "date": "01/11",
            "text": ["Eleventh day of the year. May your debugging skills be as sharp as your favorite anime protagonist's sword."]
        }, {
            "date": "01/12",
            "text": ["Twelfth day of January. The codebase may be complex, but your determination is even stronger."]
        }, {
            "date": "01/13",
            "text": ["It's January 13th. Unlucky for some, but not for developers armed with powerful debugging tools."]
        }, {
            "date": "01/14",
            "text": ["Fourteenth day of January. Debugging is like a puzzle—each issue you solve is a victory."]
        }, {
            "date": "01/15",
            "text": ["Fifteenth day of the year. May your code be as efficient as a perfectly optimized algorithm."]
        }, {
            "date": "01/16",
            "text": ["Sixteenth day of January. Code like nobody's watching, and debug like it's a life-or-death situation."]
        }, {
            "date": "01/17",
            "text": ["It's the seventeenth day of January. Time to conquer more lines of code and level up your programming skills."]
        }, {
            "date": "01/18",
            "text": ["Eighteenth day of the year. Keep coding, and remember that bugs are just temporary setbacks in your epic quest."]
        }, {
            "date": "01/19",
            "text": ["Nineteenth day of January. May your code be as clean and elegant as the UI of your favorite app."]
        }, {
            "date": "01/20",
            "text": ["Twentieth day of the year. Debugging is an art form—channel your inner artist and create flawless code."]
        }, {
            "date": "01/21",
            "text": ["Twenty-first day of January. Celebrate with a commit and a nod to your fellow developers."]
        }, {
            "date": "01/22",
            "text": ["It's January 22nd. Your code is a masterpiece in progress—keep sculpting and refining."]
        }, {
            "date": "01/23",
            "text": ["Twenty-third day of the year. Debugging is like a dance—navigate those errors with finesse."]
        }, {
            "date": "01/24",
            "text": ["Twenty-fourth day of January. The code may be complex, but so are you. Keep coding with confidence."]
        }, {
            "date": "01/25",
            "text": ["Twenty-fifth day of the year. Assemble your tools and tackle the challenges in your coding adventure."]
        }, {
            "date": "01/26",
            "text": ["It's January 26th. Your coding journey is unique—embrace the challenges and celebrate the victories."]
        }, {
            "date": "01/27",
            "text": ["Twenty-seventh day of January. Debugging requires patience and persistence—traits of a true developer."]
        }, {
            "date": "01/28",
            "text": ["Twenty-eighth day of the year. May your code be as robust as your favorite RPG character's armor."]
        }, {
            "date": "01/29",
            "text": ["Twenty-ninth day of January. Every line of code you write brings you one step closer to greatness."]
        }, {
            "date": "01/30",
            "text": ["Thirtieth day of the year. Reflect on your coding achievements and set new goals for the coming months."]
        }, {
            "date": "01/31",
            "text": ["It's the thirty-first day of January. Celebrate the end of the month with a commit that leaves a lasting impact."]
        },
        {
            "date": "02/01",
            "text": ["First day of February. Let the coding adventure of this month begin!"]
        }, {
            "date": "02/02",
            "text": ["It's February 2nd. Double down on your coding efforts, and may your variables always have meaningful names."]
        }, {
            "date": "02/03",
            "text": ["Third day of the month. Three cheers for your coding prowess! Hip, hip, hooray!"]
        }, {
            "date": "02/04",
            "text": ["Fourth day of February. May your code be as efficient as a well-optimized algorithm."]
        }, {
            "date": "02/05",
            "text": ["Fifth day of the month. Five lines of code written today—slow and steady wins the race."]
        }, {
            "date": "02/06",
            "text": ["It's February 6th. Channel your inner developer ninja and stealthily debug those issues."]
        }, {
            "date": "02/07",
            "text": ["Seventh day of February. Seven hours of coding ahead—may your focus be unwavering."]
        }, {
            "date": "02/08",
            "text": ["Eighth day of the month. Debugging is an art—paint a masterpiece with your code."]
        }, {
            "date": "02/09",
            "text": ["Ninth day of February. May your code shine as brightly as your favorite anime's opening theme."]
        }, {
            "date": "02/10",
            "text": ["Tenth day of the month. Double digits! Celebrate by refactoring a chunk of code."]
        }, {
            "date": "02/11",
            "text": ["Eleventh day of February. Code with passion, debug with determination."]
        }, {
            "date": "02/12",
            "text": ["Twelfth day of the month. The code may be complex, but so are you. You got this!"]
        }, {
            "date": "02/13",
            "text": ["It's February 13th. Unlucky for bugs, lucky for developers armed with powerful debugging skills."]
        }, {
            "date": "02/14",
            "text": ["Fourteenth day of February. Code hearts, not just lines, and celebrate your love for programming."]
        }, {
            "date": "02/15",
            "text": ["Fifteenth day of the month. May your code be as sweet as the Valentine's Day Ites you didn't share with bugs."]
        }, {
            "date": "02/16",
            "text": ["Sixteenth day of February. Code like there's no tomorrow, and debug like it's your favorite puzzle game."]
        }, {
            "date": "02/17",
            "text": ["Seventeenth day of the month. May your coding journey be as epic as your favorite RPG."]
        }, {
            "date": "02/18",
            "text": ["Eighteenth day of February. Debugging is a quest—embrace the challenges and level up."]
        }, {
            "date": "02/19",
            "text": ["Nineteenth day of the month. Every line of code is a step closer to mastering your craft."]
        }, {
            "date": "02/20",
            "text": ["Twentieth day of February. Celebrate with a commit that leaves a lasting impression."]
        }, {
            "date": "02/21",
            "text": ["Twenty-first day of the month. Cheers to the developers who make the digital world go 'round."]
        }, {
            "date": "02/22",
            "text": ["It's February 22nd. May your code be as symmetrical and elegant as the number '22'."]
        }, {
            "date": "02/23",
            "text": ["Twenty-third day of February. Navigate through code complexities like a master tactician."]
        }, {
            "date": "02/24",
            "text": ["Twenty-fourth day of the month. The code may be challenging, but so are you. Keep coding with confidence. It's also Nannan's Birtday. Wish him!"]
        }, {
            "date": "02/25",
            "text": ["Twenty-fifth day of February. Assemble your tools and conquer the challenges in your coding adventure."]
        }, {
            "date": "02/26",
            "text": ["It's February 26th. Your coding journey is unique—embrace the challenges and celebrate the victories."]
        }, {
            "date": "02/27",
            "text": ["Twenty-seventh day of February. Debugging requires patience and persistence—traits of a true developer."]
        }, {
            "date": "02/28",
            "text": ["Twenty-eighth day of the month. May your code be as robust as your favorite RPG character's armor."]
        },
        {
            "date": "03/01",
            "text": ["First day of March. Code with the energy of a thousand cherry blossoms in full bloom!"]
        }, {
            "date": "03/02",
            "text": ["Second day of the month. May your code flow as smoothly as a well-choreographed anime opening."]
        }, {
            "date": "03/03",
            "text": ["Third day of March. Three cheers for your coding skills! Keep raising the debug flag."]
        }, {
            "date": "03/04",
            "text": ["Fourth day of the month. May your code be as solid as the foundation of an isekai world."]
        }, {
            "date": "03/05",
            "text": ["Fifth day of March. Five lines of code written today—keep that creative coding streak alive."]
        }, {
            "date": "03/06",
            "text": ["It's March 6th. Channel your inner developer samurai and master the art of debugging."]
        }, {
            "date": "03/07",
            "text": ["Seventh day of March. Seven hours of coding ahead—may your focus be unwavering."]
        }, {
            "date": "03/08",
            "text": ["Eighth day of the month. Celebrate International Women's Day by giving a virtual salute to your favorite digital heroines."]
        }, {
            "date": "03/09",
            "text": ["Ninth day of March. May your code shine as brightly as your favorite anime's plot twists."]
        }, {
            "date": "03/10",
            "text": ["Tenth day of the month. Double digits! Celebrate by optimizing a chunk of code."]
        }, {
            "date": "03/11",
            "text": ["Eleventh day of March. Code with the precision of a mecha pilot and debug with determination."]
        }, {
            "date": "03/12",
            "text": ["Twelfth day of the month. The code may be complex, but so are you. You got this!"]
        }, {
            "date": "03/13",
            "text": ["It's March 13th. Unlucky for bugs, lucky for developers armed with powerful debugging skills."]
        }, {
            "date": "03/14",
            "text": ["Fourteenth day of March. Code with love, and may your projects be as sweet as pi."]
        }, {
            "date": "03/15",
            "text": ["Fifteenth day of the month. May your code be as green and lively as the St. Patrick's Day celebrations."]
        }, {
            "date": "03/16",
            "text": ["Sixteenth day of March. Code like there's no tomorrow, and debug like it's your favorite visual novel mystery."]
        }, {
            "date": "03/17",
            "text": ["Seventeenth day of the month. May your coding journey be as epic as a quest in your favorite RPG."]
        }, {
            "date": "03/18",
            "text": ["Eighteenth day of March. Debugging is a quest—embrace the challenges and level up."]
        }, {
            "date": "03/19",
            "text": ["Nineteenth day of the month. Every line of code is a step closer to mastering your craft."]
        }, {
            "date": "03/20",
            "text": ["Twentieth day of March. Celebrate with a commit that leaves a lasting impression."]
        }, {
            "date": "03/21",
            "text": ["Twenty-first day of the month. Cheers to the developers who make the digital world go 'round."]
        }, {
            "date": "03/22",
            "text": ["It's March 22nd. May your code be as symmetrical and elegant as the number '22'."]
        }, {
            "date": "03/23",
            "text": ["Twenty-third day of March. Navigate through code complexities like a master tactician."]
        }, {
            "date": "03/24",
            "text": ["Twenty-fourth day of the month. The code may be challenging, but so are you. Keep coding with confidence."]
        }, {
            "date": "03/25",
            "text": ["Twenty-fifth day of March. Assemble your tools and conquer the challenges in your coding adventure."]
        }, {
            "date": "03/26",
            "text": ["It's March 26th. Your coding journey is unique—embrace the challenges and celebrate the victories."]
        }, {
            "date": "03/27",
            "text": ["Twenty-seventh day of March. Debugging requires patience and persistence—traits of a true developer."]
        }, {
            "date": "03/28",
            "text": ["Twenty-eighth day of the month. May your code be as robust as your favorite RPG character's armor."]
        }, {
            "date": "03/29",
            "text": ["Twenty-ninth day of March. Every bug squashed is a victory won in the coding battlefield."]
        }, {
            "date": "03/30",
            "text": ["Thirtieth day of the month. Reflect on your coding achievements and set new goals for the coming months."]
        }, {
            "date": "03/31",
            "text": ["It's the thirty-first day of March. Celebrate the end of the month with a commit that leaves a lasting impact."]
        },
        {
            "date": "04/01",
            "text": ["It's April 1st. Be wary of code pranks and false commits. Happy April Fools' Day, fellow developer!"]
        }, {
            "date": "04/02",
            "text": ["Second day of April. No fooling around with code—unless it's intentional. Keep it bug-free!"]
        }, {
            "date": "04/03",
            "text": ["Third day of the month. Three cheers for your coding skills! May your functions be as efficient as a well-oiled machine."]
        }, {
            "date": "04/04",
            "text": ["Fourth day of April. May your code be as robust as your favorite mecha in action."]
        }, {
            "date": "04/05",
            "text": ["Fifth day of April. Five lines of code written today—keep that creative coding streak alive."]
        }, {
            "date": "04/06",
            "text": ["It's April 6th. Channel your inner code ninja and stealthily debug those issues."]
        }, {
            "date": "04/07",
            "text": ["Seventh day of April. Seven hours of coding ahead—may your focus be unwavering."]
        }, {
            "date": "04/08",
            "text": ["Eighth day of the month. Celebrate the harmony of your code. May it resonate like your favorite anime soundtrack."]
        }, {
            "date": "04/09",
            "text": ["Ninth day of April. May your code shine as brightly as your favorite anime's dazzling visuals."]
        }, {
            "date": "04/10",
            "text": ["Tenth day of the month. Double digits! Celebrate by refactoring a chunk of code."]
        }, {
            "date": "04/11",
            "text": ["Eleventh day of April. Code with the precision of a mecha pilot and debug with determination."]
        }, {
            "date": "04/12",
            "text": ["Twelfth day of the month. The code may be complex, but so are you. You got this!"]
        }, {
            "date": "04/13",
            "text": ["It's April 13th. Unlucky for bugs, lucky for developers armed with powerful debugging skills."]
        }, {
            "date": "04/14",
            "text": ["Fourteenth day of April. May your code be as sweet as cherry blossoms in spring."]
        }, {
            "date": "04/15",
            "text": ["Fifteenth day of the month. May your code be as colorful and vibrant as the Sakura season."]
        }, {
            "date": "04/16",
            "text": ["Sixteenth day of April. Code like there's no tomorrow, and debug like it's your favorite mystery novel."]
        }, {
            "date": "04/17",
            "text": ["Seventeenth day of the month. May your coding journey be as epic as a quest in your favorite RPG."]
        }, {
            "date": "04/18",
            "text": ["Eighteenth day of April. Debugging is a quest—embrace the challenges and level up."]
        }, {
            "date": "04/19",
            "text": ["Nineteenth day of the month. Every line of code is a step closer to mastering your craft."]
        }, {
            "date": "04/20",
            "text": ["Twentieth day of April. Celebrate with a commit that leaves a lasting impression."]
        }, {
            "date": "04/21",
            "text": ["Twenty-first day of the month. Cheers to the developers who make the digital world go 'round."]
        }, {
            "date": "04/22",
            "text": ["It's April 22nd. May your code be as symmetrical and elegant as the number '22'."]
        }, {
            "date": "04/23",
            "text": ["Twenty-third day of April. Navigate through code complexities like a master tactician."]
        }, {
            "date": "04/24",
            "text": ["Twenty-fourth day of the month. The code may be challenging, but so are you. Keep coding with confidence."]
        }, {
            "date": "04/25",
            "text": ["Twenty-fifth day of April. Assemble your tools and conquer the challenges in your coding adventure."]
        }, {
            "date": "04/26",
            "text": ["It's April 26th. Your coding journey is unique—embrace the challenges and celebrate the victories."]
        }, {
            "date": "04/27",
            "text": ["Twenty-seventh day of April. Debugging requires patience and persistence—traits of a true developer."]
        }, {
            "date": "04/28",
            "text": ["Twenty-eighth day of the month. May your code be as robust as your favorite RPG character's armor."]
        }, {
            "date": "04/29",
            "text": ["Twenty-ninth day of April. Every bug squashed is a victory won in the coding battlefield."]
        }, {
            "date": "04/30",
            "text": ["Thirtieth day of the month. Reflect on your coding achievements and set new goals for the coming months."]
        }        
    ]       
    
}